//=============================================================================
//
// モーション処理 [motion.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _MOTION_H_
#define _MOTION_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "fileload.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CModel;	// モデルクラス

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMotionController
{
public:
	CMotionController();	// デフォルトコンストラクタ
	~CMotionController();	// デフォルトデストラクタ
	bool PlayMotin(string type);	// モーションのプレイ
	static CMotionController *Create(CFileLoad::MODEL_INFO motion, vector<CModel*> model);	// 生成

private:
	void ModifyingInfo(void);	// 情報の修正
	CFileLoad::MODEL_INFO m_model_info;	// モデル情報
	vector<CModel*> m_model;	// モデル
};

#endif
