//=============================================================================
//
// オンライン対戦(onlinegame.h)
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _ONLINEGAME_H_
#define _ONLINEGAME_H_

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CEnemyPlayer;

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class COnlineGame : public CObject
{
public:
	COnlineGame(LAYER_TYPE layer = LAYER_TYPE::LAYER_00);	// デフォルトコンストラクタ
	~COnlineGame();	// デフォルトデストラクタ
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

private:
	void Matching(void);	// マッチング
	CEnemyPlayer *m_enemy_player;	// 敵
};

#endif // !_TITLE_H_