//=============================================================================
//
// オンライン対戦(onlinegame.cpp)
// Author : 羽鳥太一
//
//=============================================================================
//=============================================================================
// インクルード
//=============================================================================
#include "onlinegame.h"
#include "manager.h"
#include "networkmanager.h"
#include "communicationdata.h"
#include "enemyplayer.h"

//=============================================================================
// デフォルトコンストラクタ
//=============================================================================
COnlineGame::COnlineGame(CObject::LAYER_TYPE layer) :CObject(layer)
{

}

//=============================================================================
// デフォルトデストラクタ
//=============================================================================
COnlineGame::~COnlineGame()
{

}

//=============================================================================
// 初期化処理
//=============================================================================
HRESULT COnlineGame::Init(void)
{
	// マッチング
	Matching();
	
	return S_OK;
}

//=============================================================================
// 終了処理
//=============================================================================
void COnlineGame::Uninit(void)
{
	//オブジェクトの破棄
	Release();
}

//=============================================================================
// 更新処理
//=============================================================================
void COnlineGame::Update(void)
{

}

//=============================================================================
// 描画処理
//=============================================================================
void COnlineGame::Draw(void)
{

}

//=============================================================================
// マッチング
//=============================================================================
void COnlineGame::Matching(void)
{
	CTcpClient *client = CManager::GetInstance()->GetNetWorkManager()->GetCommunication();	// 通信クラスの取得
	CCommunicationData::COMMUNICATION_DATA *player_data = CManager::GetInstance()->GetNetWorkManager()->GetPlayerData()->GetCmmuData();	// プレイヤーデータの取得

	// 初期化
	client->Init();

	// 通信
	client->Connect();

	// 通信確立したら
	if (client->GetConnect() == true)
	{
		// レシーブスレッドを作成
		CManager::GetInstance()->GetNetWorkManager()->CreateRecvThread();
	}

	// 敵数分のループ
	for (int count_enemy = 0; count_enemy < MAX_PLAYER - 1; count_enemy++)
	{
		m_enemy_player = CEnemyPlayer::Create();
	}
}