//=============================================================================
//
// タイトル処理
// Author : 林海斗
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "object.h"
//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CObject2D;
class CMove_UI;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CTitle : public CObject
{
public:
	CTitle(LAYER_TYPE layer = LAYER_TYPE::LAYER_00);	// デフォルトコンストラクタ
	~CTitle();	// デフォルトデストラクタ
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画

private:
	void StageCreate(void);
	void CameraRotMove(void);
	bool m_bNextMode;
	bool m_bEnd;
	CObject2D *m_pTitleLogo;//タイトルロゴ
	CMove_UI *m_pPushStart;
	int m_bEndTimer;
};

#endif // !_TITLE_H_